Revit 2027 API
Part.OriginalCategoryId Property
 The category Id of the original element corresponding to this Part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OriginalCategoryId { get; set; }
Public Property OriginalCategoryId As ElementId
	Get
	Set
public:
property ElementId^ OriginalCategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member OriginalCategoryId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: dPartOriginalCategoryId is not an available member of the original category ids of the elements which formed this Part.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace